Angad2205/Yog-Guru-VLSID-design-challenge/camera/coffee_machine/cm4/board/pin_mux.c
    /*
     * MIPI Panel Touch Pins
     */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_11_GPIO8_IO21, 0U); // TOUCH_RST
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_10_GPIO8_IO20, 0U); // TOUCH_INT

    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_04_LPI2C5_SDA, 1U); // TOUCH_I2C
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_05_LPI2C5_SCL, 1U); // TOUCH_I2C

    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_04_LPI2C5_SDA, /* GPIO_LPSR_04 PAD functional properties : */
                        0x2EU);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: normal driver
                                                           Pull / Keep Select Field: Pull Disable
                                                           Pull Up / Down Config. Field: Weak pull up
                                                           Open Drain LPSR Field: Enabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_05_LPI2C5_SCL, /* GPIO_LPSR_05 PAD functional properties : */
                        0x2EU);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: normal driver
                                                           Pull / Keep Select Field: Pull Disable
                                                           Pull Up / Down Config. Field: Weak pull up
                                                           Open Drain LPSR Field: Enabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */
#endif
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMipiCameraPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: L14, peripheral: GPIO9, signal: 'gpio_io, 25', pin_signal: GPIO_AD_26, direction: OUTPUT}
  - {pin_num: A7, peripheral: GPIO11, signal: 'gpio_io, 15', pin_signal: GPIO_DISP_B2_14, direction: OUTPUT}
  - {pin_num: R8, peripheral: LPI2C6, signal: SCL, pin_signal: GPIO_LPSR_07, software_input_on: Enable}
  - {pin_num: P8, peripheral: LPI2C6, signal: SDA, pin_signal: GPIO_LPSR_06, software_input_on: Enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMipiCameraPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
#if TARGET_BOARD == BOARD_1170EVK
void BOARD_InitMipiCameraPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc);      /* LPCG on: LPCG is ON. */
    CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr); /* LPCG on: LPCG is ON. */

    /* GPIO configuration of CAMERA_PWDN on GPIO_AD_26 (pin L14) */
    gpio_pin_config_t CAMERA_PWDN_config = {
        .direction = kGPIO_DigitalOutput, .outputLogic = 0U, .interruptMode = kGPIO_NoIntmode};
    /* Initialize GPIO functionality on GPIO_AD_26 (pin L14) */
    GPIO_PinInit(GPIO9, 25U, &CAMERA_PWDN_config);

    /* GPIO configuration of CAMERA_RST on GPIO_DISP_B2_14 (pin A7) */
    gpio_pin_config_t CAMERA_RST_config = {
        .direction = kGPIO_DigitalOutput, .outputLogic = 0U, .interruptMode = kGPIO_NoIntmode};
    /* Initialize GPIO functionality on GPIO_DISP_B2_14 (pin A7) */
    GPIO_PinInit(GPIO11, 15U, &CAMERA_RST_config);

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_26_GPIO9_IO25, /* GPIO_AD_26 is configured as GPIO9_IO25 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B2_14_GPIO11_IO15, /* GPIO_DISP_B2_14 is configured as GPIO11_IO15 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_06_LPI2C6_SDA, /* GPIO_LPSR_06 is configured as LPI2C6_SDA */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_06 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_07_LPI2C6_SCL, /* GPIO_LPSR_07 is configured as LPI2C6_SCL */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_07 */
}
#elif TARGET_BOARD == BOARD_SMART_TLHMI
void BOARD_InitMipiCameraPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc);      /* LPCG on: LPCG is ON. */
    CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr); /* LPCG on: LPCG is ON. */

    /* GPIO configuration of GC2145_24MHz_EN on GPIO_SNVS_07_DIG (pin R9) */
    gpio_pin_config_t GC2145_24MHz_EN_config = {
        .direction = kGPIO_DigitalOutput, .outputLogic = 1U, .interruptMode = kGPIO_NoIntmode};
    /* Initialize GPIO functionality on GPIO_SNVS_07_DIG (pin R9) */
    GPIO_PinInit(GPIO13, 10U, &GC2145_24MHz_EN_config);

    /* GPIO configuration of GC2145_RESET on GPIO_SNVS_02_DIG (pin L9) */
    gpio_pin_config_t CAMERA_RST_config = {
        .direction = kGPIO_DigitalOutput, .outputLogic = 0U, .interruptMode = kGPIO_NoIntmode};
    /* Initialize GPIO functionality on GPIO_SNVS_02_DIG (pin L9) */
    GPIO_PinInit(GPIO13, 5U, &CAMERA_RST_config);

    /* GPIO configuration of GC2145_PWDN on GPIO_SNVS_06_DIG (pin M9) */
    gpio_pin_config_t CAMERA_PWDN_config = {
        .direction = kGPIO_DigitalOutput, .outputLogic = 1U, .interruptMode = kGPIO_NoIntmode};
    /* Initialize GPIO functionality on GPIO_SNVS_06_DIG (pin M9) */
    GPIO_PinInit(GPIO13, 9U, &CAMERA_PWDN_config);

    /* GPIO configuration of PMIC_STBY_REQ(VDD_2V8 DCDC enable) on PMIC_STBY_REQ_DIG (pin T9) */
    gpio_pin_config_t PMIC_STBY_REQ_config = {
        .direction = kGPIO_DigitalOutput, .outputLogic = 1U, .interruptMode = kGPIO_NoIntmode};
    /* Initialize GPIO functionality on PMIC_STBY_REQ_DIG (pin T9) */
    GPIO_PinInit(GPIO13, 2U, &PMIC_STBY_REQ_config);

    /*VDD_2V8 DCDC enable*/
    IOMUXC_SetPinMux(IOMUXC_PMIC_STBY_REQ_DIG_GPIO13_IO02, /* PMIC_STBY_REQ_DIG is configured as GPIO13_IO02 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */

    /* GC2145_24MHz_EN*/
    IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_07_DIG_GPIO13_IO10, /* GPIO_SNVS_07_DIG is configured as GPIO13_IO10 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */

    /* GC2145_RESET */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_02_DIG_GPIO13_IO05, /* GPIO_SNVS_02_DIG is configured as GPIO13_IO05 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    /* GC2145_PWDN */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_06_DIG_GPIO13_IO09, /* GPIO_SNVS_06_DIG is configured as GPIO13_IO09 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    /* I2C Setting Interface */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_06_LPI2C6_SDA, /* GPIO_LPSR_06 is configured as LPI2C6_SDA */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_06 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_07_LPI2C6_SCL, /* GPIO_LPSR_07 is configured as LPI2C6_SCL */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_07 */
    /* MCLK */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_13_VIDEO_MUX_CSI_MCLK, /* GPIO_AD_13 is configured as VIDEO_MUX_CSI_MCLK */
                     0U); /* Software Input On Field: Input Path is determined by functionality */

    /* Pin Config for SDA, SCL */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_06_LPI2C6_SDA, /* GPIO_LPSR_06 PAD functional properties : */
                        0x2EU);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: high driver
                                                           Pull / Keep Select Field: Pull Enable
                                                           Pull Up / Down Config. Field: Weak pull up
                                                           Open Drain LPSR Field: Enabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_07_LPI2C6_SCL, /* GPIO_LPSR_07 PAD functional properties : */
                        0x2EU);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: high driver
                                                           Pull / Keep Select Field: Pull Enable
                                                           Pull Up / Down Config. Field: Weak pull up
                                                           Open Drain LPSR Field: Enabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */
    /* MCLK */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_13_VIDEO_MUX_CSI_MCLK, /* GPIO_AD_13 PAD functional properties : */
                        0x04U);                               /* Slew Rate Field: Slow Slew Rate
                                                      Drive Strength Field: normal drive strength
                                                      Pull / Keep Select Field: Pull Enable
                                                      Pull Up / Down Config. Field: Weak pull down
                                                      Open Drain Field: Disabled
                                                      Domain write protection: Both cores are allowed
                                                      Domain write protection lock: Neither of DWP bits is locked */
}
#endif

