Angad2205/Yog-Guru-VLSID-design-challenge/camera/coffee_machine/cm4/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitParallelCameraPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitParallelCameraPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc);      /* LPCG on: LPCG is ON. */
    CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr); /* LPCG on: LPCG is ON. */

    /* I2C Setting Interface */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_06_LPI2C6_SDA, /* GPIO_LPSR_06 is configured as LPI2C6_SDA */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_06 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_07_LPI2C6_SCL, /* GPIO_LPSR_07 is configured as LPI2C6_SCL */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_07 */

    /*3DIC_PWR */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_06_DIG_GPIO13_IO09, /* GPIO_SNVS_06_DIG is configured as GPIO13_IO09 */
                     0U);
    /* IR_RESET */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_14_GPIO_MUX2_IO24, /* GPIO_EMC_B2_14 is configured as GPIO_MUX2_IO24*/
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_GPR->GPR41 =
        ((IOMUXC_GPR->GPR41 &
          (~(IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
         | IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH(
               0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
        );

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_12_VIDEO_MUX_CSI_PIXCLK, /* GPIO_AD_12 is configured as VIDEO_MUX_CSI_PIXCLK */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_13_VIDEO_MUX_CSI_MCLK, /* GPIO_AD_13 is configured as VIDEO_MUX_CSI_MCLK */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_14_VIDEO_MUX_CSI_VSYNC, /* GPIO_AD_14 is configured as VIDEO_MUX_CSI_VSYNC */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_15_VIDEO_MUX_CSI_HSYNC, /* GPIO_AD_15 is configured as VIDEO_MUX_CSI_HSYNC */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_16_VIDEO_MUX_CSI_DATA09, /* GPIO_AD_16 is configured as VIDEO_MUX_CSI_DATA09 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_17_VIDEO_MUX_CSI_DATA08, /* GPIO_AD_17 is configured as VIDEO_MUX_CSI_DATA08 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_18_VIDEO_MUX_CSI_DATA07, /* GPIO_AD_18 is configured as VIDEO_MUX_CSI_DATA07 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_19_VIDEO_MUX_CSI_DATA06, /* GPIO_AD_19 is configured as VIDEO_MUX_CSI_DATA06 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_20_VIDEO_MUX_CSI_DATA05, /* GPIO_AD_20 is configured as VIDEO_MUX_CSI_DATA05 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_21_VIDEO_MUX_CSI_DATA04, /* GPIO_AD_21 is configured as VIDEO_MUX_CSI_DATA04 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_22_VIDEO_MUX_CSI_DATA03, /* GPIO_AD_22 is configured as VIDEO_MUX_CSI_DATA03 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_23_VIDEO_MUX_CSI_DATA02, /* GPIO_AD_23 is configured as VIDEO_MUX_CSI_DATA02 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_06_LPI2C6_SDA, /* GPIO_LPSR_06 PAD functional properties : */
                        0x20U);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: high driver
                                                           Pull / Keep Select Field: Pull Enable
                                                           Pull Up / Down Config. Field: Weak pull up
                                                           Open Drain LPSR Field: Enabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_07_LPI2C6_SCL, /* GPIO_LPSR_07 PAD functional properties : */
                        0x20U);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: high driver
                                                           Pull / Keep Select Field: Pull Enable
                                                           Pull Up / Down Config. Field: Weak pull up
                                                           Open Drain LPSR Field: Enabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_SNVS_06_DIG_GPIO13_IO09, /* GPIO_SNVS_06_DIG PAD functional properties : */
                        0x0EU);                              /* Slew Rate Field: Slow Slew Rate
                                                                Drive Strength Field: high driver
                                                                Pull / Keep Select Field: Pull Enable
                                                                Pull Up / Down Config. Field: Weak pull up
                                                                Open Drain SNVS Field: Disabled
                                                                Domain write protection: Both cores are allowed
                                                                Domain write protection lock: Neither of DWP bits is locked */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_14_GPIO_MUX2_IO24, /* GPIO_SNVS_06_DIG PAD functional properties : */
                        0x0EU);                               /* Slew Rate Field: Slow Slew Rate
                                                                 Drive Strength Field: high driver
                                                                 Pull / Keep Select Field: Pull Enable
                                                                 Pull Up / Down Config. Field: Weak pull up
                                                                 Open Drain SNVS Field: Disabled
                                                                 Domain write protection: Both cores are allowed
                                                                 Domain write protection lock: Neither of DWP bits is locked */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_13_VIDEO_MUX_CSI_MCLK, /* GPIO_AD_13 PAD functional properties : */
                        0x04U);                               /* Slew Rate Field: Slow Slew Rate
                                                                 Drive Strength Field: normal drive strength
                                                                 Pull / Keep Select Field: Pull Enable
                                                                 Pull Up / Down Config. Field: Weak pull down
                                                                 Open Drain Field: Disabled
                                                                 Domain write protection: Both cores are allowed
                                                                 Domain write protection lock: Neither of DWP bits is locked */

    /* Set the pins for CSI reset and power down. */
    gpio_pin_config_t pinConfig = {
        kGPIO_DigitalOutput,
        0,
        kGPIO_NoIntmode,
    };

    /* GC0308 Sensor PWDN
     * 0: normal work,
     * 1: standby     */
    GPIO_PinInit(BOARD_CSI_CAMERA_PWDN_GPIO, BOARD_CSI_CAMERA_PWDN_PIN, &pinConfig);

