Angad2205/Yog-Guru-VLSID-design-challenge/camera/coffee_machine/cm4/board/pin_mux.c
    /* GC0308 Sensor Reset
     * 0: chip reset
     * 1: normal work. */
    pinConfig.outputLogic = 1;
    GPIO_PinInit(BOARD_CSI_CAMERA_RESET_GPIO, BOARD_CSI_CAMERA_RESET_PIN, &pinConfig);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexioCameraPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlexioCameraPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc);      /* LPCG on: LPCG is ON. */
    CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr); /* LPCG on: LPCG is ON. */

    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_04_LPI2C5_SDA, /* GPIO_LPSR_04 is configured as LPI2C5_SDA */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_04 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_05_LPI2C5_SCL, /* GPIO_LPSR_05 is configured as LPI2C5_SCL */
                     1U);                            /* Software Input On Field: Force input path of pad GPIO_LPSR_05 */

    /* CSI Interface */
    /* DATA 0-7 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_24_FLEXIO2_D24, /* GPIO_AD_24 is configured as FLEXIO2_D24 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_25_FLEXIO2_D25, /* GPIO_AD_25 is configured as FLEXIO2_D25 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_26_FLEXIO2_D26, /* GPIO_AD_26 is configured as FLEXIO2_D26 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_27_FLEXIO2_D27, /* GPIO_AD_27 is configured as FLEXIO2_D27 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_28_FLEXIO2_D28, /* GPIO_AD_28 is configured as FLEXIO2_D28 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_29_FLEXIO2_D29, /* GPIO_AD_29 is configured as FLEXIO2_D29 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_30_FLEXIO2_D30, /* GPIO_AD_30 is configured as FLEXIO2_D30 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_31_FLEXIO2_D31, /* GPIO_AD_31 is configured as FLEXIO2_D31 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */

    /* MCLK */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_00_FLEXIO2_D00, /* GPIO_AD_000 is configured as FLEXIO2_D00 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    /* PIXCLK */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_01_FLEXIO2_D01, /* GPIO_AD_01 is configured as FLEXIO2_D01 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    /* HSYNC */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_02_FLEXIO2_D02, /* GPIO_AD_02 is configured as FLEXIO2_D02 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    /* VSYNC */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_32_GPIO_MUX3_IO31, /* GPIO_AD_32 is configured as GPIO_MUX3_IO31 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    /* PWDN */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_04_GPIO10_IO13, /* GPIO_SD_B2_04 is configured as GPIO10_IO13 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    /* RESET */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_15_GPIO_MUX2_IO25, /* GPIO_SNVS_02 is configured as GPIO13_IO25 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_GPR->GPR41 =
        ((IOMUXC_GPR->GPR41 &
          (~(IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
         | IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH(
               0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
        );

    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_04_LPI2C5_SDA, /* GPIO_SD_B2_10 PAD functional properties : */
                        0x20U);                         /* PDRV Field: normal drive strength
                                                           Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                           Open Drain Field: Disabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_05_LPI2C5_SCL, /* GPIO_SD_B2_11 PAD functional properties : */
                        0x20U);                         /* PDRV Field: normal drive strength
                                                           Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                           Open Drain Field: Disabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_09_FLEXIO2_D09,  /* GPIO_AD_09 PAD functional properties : */
                        0x04U);                         /* Slew Rate Field: Slow Slew Rate
                                                           Drive Strength Field: normal drive strength
                                                           Pull / Keep Select Field: Pull Enable
                                                           Pull Up / Down Config. Field: Weak pull down
                                                           Open Drain Field: Disabled
                                                           Domain write protection: Both cores are allowed
                                                           Domain write protection lock: Neither of DWP bits is locked */

    /* Set the pins for CSI reset and power down. */
    gpio_pin_config_t pinConfig = {
        kGPIO_DigitalOutput,
        0,
        kGPIO_NoIntmode,
    };

    /* GC0308 Sensor PWDN
     * 0: normal work,
     * 1: standby     */
    GPIO_PinInit(BOARD_FLEXIO_CAMERA_PWDN_GPIO, BOARD_FLEXIO_CAMERA_PWDN_PIN, &pinConfig);

