Angad2205/Yog-Guru-VLSID-design-challenge/camera/coffee_machine/cm4/board/pin_mux.c
    /* GC0308 Sensor Reset
     * 0: chip reset
     * 1: normal work. */
    pinConfig.outputLogic = 1;
    GPIO_PinInit(BOARD_FLEXIO_CAMERA_RESET_GPIO, BOARD_FLEXIO_CAMERA_RESET_PIN, &pinConfig);
}

/* FUNCTION
 * ************************************************************************************************************
 *
 * Function Name : BOARD_InitButtonPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END
 * ****************************************************************************************************************/
void BOARD_InitPushButtonPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc); /* LPCG on: LPCG is ON. */

    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_05_GPIO_MUX2_IO15, /* GPIO_EMC_B2_05 is configured as GPIO_MUX2_IO15 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_05_GPIO_MUX2_IO15, /* GPIO_EMC_B2_05 PAD functional properties : */
                        0x0CU);                               /* PDRV Field: high drive strength
                                                                 Pull Down Pull Up Field: No Pull
                                                                 Open Drain Field: Disabled
                                                                 Domain write protection: Both cores are allowed
                                                                 Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_06_GPIO_MUX2_IO16,    /* GPIO_EMC_B2_06 is configured as GPIO_MUX2_IO16 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_06_GPIO_MUX2_IO16, /* GPIO_EMC_B2_06 PAD functional properties : */
                        0x0CU);                               /* PDRV Field: high drive strength
                                                                 Pull Down Pull Up Field: No Pull
                                                                 Open Drain Field: Disabled
                                                                 Domain write protection: Both cores are allowed
                                                                 Domain write protection lock: Neither of DWP bits is locked */

    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_07_GPIO_MUX2_IO17, /* GPIO_EMC_B2_07 is configured as GPIO_MUX2_IO17 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_07_GPIO_MUX2_IO17, /* GPIO_EMC_B2_07 PAD functional properties : */
                        0x0CU);                               /* PDRV Field: high drive strength
                                                                 Pull Down Pull Up Field: No Pull
                                                                 Open Drain Field: Disabled
                                                                 Domain write protection: Both cores are allowed
                                                                 Domain write protection lock: Neither of DWP bits is locked */

    IOMUXC_GPR->GPR40 =
        ((IOMUXC_GPR->GPR40 &
          (~(IOMUXC_GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW_MASK))) /* Mask bits to zero which are setting */
         | IOMUXC_GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW(
               0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
        );
    IOMUXC_GPR->GPR41 =
        ((IOMUXC_GPR->GPR41 &
          (~(IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
         | IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH(
               0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
        );
    /* PB_WAKEUP */
    IOMUXC_SetPinMux(IOMUXC_WAKEUP_DIG_GPIO13_IO00, /* WAKEUP_DIG is configured as GPIO13_IO00 */
                     1U);                           /* Software Input On Field: Force input path of pad WAKEUP_DIG */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
